HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxDmu_bf.h
/** \brief Offset for Ifx_DMU_HF_OPERATION_Bits.ERASE */
#define IFX_DMU_HF_OPERATION_ERASE_OFF (1u)

/** \brief Length for Ifx_DMU_HF_PROTECT_Bits.PRODISP */
#define IFX_DMU_HF_PROTECT_PRODISP_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_PROTECT_Bits.PRODISP */
#define IFX_DMU_HF_PROTECT_PRODISP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_PROTECT_Bits.PRODISP */
#define IFX_DMU_HF_PROTECT_PRODISP_OFF (0u)

/** \brief Length for Ifx_DMU_HF_PROTECT_Bits.PRODISD */
#define IFX_DMU_HF_PROTECT_PRODISD_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_PROTECT_Bits.PRODISD */
#define IFX_DMU_HF_PROTECT_PRODISD_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_PROTECT_Bits.PRODISD */
#define IFX_DMU_HF_PROTECT_PRODISD_OFF (1u)

/** \brief Length for Ifx_DMU_HF_PROTECT_Bits.PRODISDBG */
#define IFX_DMU_HF_PROTECT_PRODISDBG_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_PROTECT_Bits.PRODISDBG */
#define IFX_DMU_HF_PROTECT_PRODISDBG_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_PROTECT_Bits.PRODISDBG */
#define IFX_DMU_HF_PROTECT_PRODISDBG_OFF (2u)

/** \brief Length for Ifx_DMU_HF_PROTECT_Bits.PRODISEC */
#define IFX_DMU_HF_PROTECT_PRODISEC_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_PROTECT_Bits.PRODISEC */
#define IFX_DMU_HF_PROTECT_PRODISEC_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_PROTECT_Bits.PRODISEC */
#define IFX_DMU_HF_PROTECT_PRODISEC_OFF (3u)

/** \brief Length for Ifx_DMU_HF_PROTECT_Bits.PRODISBMHD */
#define IFX_DMU_HF_PROTECT_PRODISBMHD_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_PROTECT_Bits.PRODISBMHD */
#define IFX_DMU_HF_PROTECT_PRODISBMHD_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_PROTECT_Bits.PRODISBMHD */
#define IFX_DMU_HF_PROTECT_PRODISBMHD_OFF (4u)

/** \brief Length for Ifx_DMU_HF_PROTECT_Bits.PRODISSWAP */
#define IFX_DMU_HF_PROTECT_PRODISSWAP_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_PROTECT_Bits.PRODISSWAP */
#define IFX_DMU_HF_PROTECT_PRODISSWAP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_PROTECT_Bits.PRODISSWAP */
#define IFX_DMU_HF_PROTECT_PRODISSWAP_OFF (5u)

/** \brief Length for Ifx_DMU_HF_PROTECT_Bits.PRODISP0 */
#define IFX_DMU_HF_PROTECT_PRODISP0_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_PROTECT_Bits.PRODISP0 */
#define IFX_DMU_HF_PROTECT_PRODISP0_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_PROTECT_Bits.PRODISP0 */
#define IFX_DMU_HF_PROTECT_PRODISP0_OFF (8u)

/** \brief Length for Ifx_DMU_HF_PROTECT_Bits.PRODISP1 */
#define IFX_DMU_HF_PROTECT_PRODISP1_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_PROTECT_Bits.PRODISP1 */
#define IFX_DMU_HF_PROTECT_PRODISP1_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_PROTECT_Bits.PRODISP1 */
#define IFX_DMU_HF_PROTECT_PRODISP1_OFF (9u)

/** \brief Length for Ifx_DMU_HF_PROTECT_Bits.SRT */
#define IFX_DMU_HF_PROTECT_SRT_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_PROTECT_Bits.SRT */
#define IFX_DMU_HF_PROTECT_SRT_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_PROTECT_Bits.SRT */
#define IFX_DMU_HF_PROTECT_SRT_OFF (24u)

/** \brief Length for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD0O */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD0O_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD0O */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD0O_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD0O */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD0O_OFF (0u)

/** \brief Length for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD1O */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD1O_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD1O */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD1O_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD1O */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD1O_OFF (2u)

/** \brief Length for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD2O */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD2O_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD2O */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD2O_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD2O */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD2O_OFF (4u)

/** \brief Length for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD3O */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD3O_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD3O */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD3O_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD3O */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD3O_OFF (6u)

/** \brief Length for Ifx_DMU_HF_CONFIRM0_Bits.PROINUSER */
#define IFX_DMU_HF_CONFIRM0_PROINUSER_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM0_Bits.PROINUSER */
#define IFX_DMU_HF_CONFIRM0_PROINUSER_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM0_Bits.PROINUSER */
#define IFX_DMU_HF_CONFIRM0_PROINUSER_OFF (10u)

/** \brief Length for Ifx_DMU_HF_CONFIRM0_Bits.PROINTEST */
#define IFX_DMU_HF_CONFIRM0_PROINTEST_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM0_Bits.PROINTEST */
#define IFX_DMU_HF_CONFIRM0_PROINTEST_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM0_Bits.PROINTEST */
#define IFX_DMU_HF_CONFIRM0_PROINTEST_OFF (12u)

/** \brief Length for Ifx_DMU_HF_CONFIRM0_Bits.PROINHSMCFG */
#define IFX_DMU_HF_CONFIRM0_PROINHSMCFG_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM0_Bits.PROINHSMCFG */
#define IFX_DMU_HF_CONFIRM0_PROINHSMCFG_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM0_Bits.PROINHSMCFG */
#define IFX_DMU_HF_CONFIRM0_PROINHSMCFG_OFF (14u)

/** \brief Length for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD0C */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD0C_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD0C */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD0C_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD0C */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD0C_OFF (16u)

/** \brief Length for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD1C */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD1C_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD1C */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD1C_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD1C */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD1C_OFF (18u)

/** \brief Length for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD2C */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD2C_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD2C */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD2C_MSK (0x3u)

