HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxDmu_bf.h
/** \brief Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S142ROM */
#define IFX_DMU_HP_PROCON_OTP4_S142ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S142ROM */
#define IFX_DMU_HP_PROCON_OTP4_S142ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S142ROM */
#define IFX_DMU_HP_PROCON_OTP4_S142ROM_OFF (14u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S143ROM */
#define IFX_DMU_HP_PROCON_OTP4_S143ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S143ROM */
#define IFX_DMU_HP_PROCON_OTP4_S143ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S143ROM */
#define IFX_DMU_HP_PROCON_OTP4_S143ROM_OFF (15u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S144ROM */
#define IFX_DMU_HP_PROCON_OTP4_S144ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S144ROM */
#define IFX_DMU_HP_PROCON_OTP4_S144ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S144ROM */
#define IFX_DMU_HP_PROCON_OTP4_S144ROM_OFF (16u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S145ROM */
#define IFX_DMU_HP_PROCON_OTP4_S145ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S145ROM */
#define IFX_DMU_HP_PROCON_OTP4_S145ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S145ROM */
#define IFX_DMU_HP_PROCON_OTP4_S145ROM_OFF (17u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S146ROM */
#define IFX_DMU_HP_PROCON_OTP4_S146ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S146ROM */
#define IFX_DMU_HP_PROCON_OTP4_S146ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S146ROM */
#define IFX_DMU_HP_PROCON_OTP4_S146ROM_OFF (18u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S147ROM */
#define IFX_DMU_HP_PROCON_OTP4_S147ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S147ROM */
#define IFX_DMU_HP_PROCON_OTP4_S147ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S147ROM */
#define IFX_DMU_HP_PROCON_OTP4_S147ROM_OFF (19u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S148ROM */
#define IFX_DMU_HP_PROCON_OTP4_S148ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S148ROM */
#define IFX_DMU_HP_PROCON_OTP4_S148ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S148ROM */
#define IFX_DMU_HP_PROCON_OTP4_S148ROM_OFF (20u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S149ROM */
#define IFX_DMU_HP_PROCON_OTP4_S149ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S149ROM */
#define IFX_DMU_HP_PROCON_OTP4_S149ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S149ROM */
#define IFX_DMU_HP_PROCON_OTP4_S149ROM_OFF (21u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S150ROM */
#define IFX_DMU_HP_PROCON_OTP4_S150ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S150ROM */
#define IFX_DMU_HP_PROCON_OTP4_S150ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S150ROM */
#define IFX_DMU_HP_PROCON_OTP4_S150ROM_OFF (22u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S151ROM */
#define IFX_DMU_HP_PROCON_OTP4_S151ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S151ROM */
#define IFX_DMU_HP_PROCON_OTP4_S151ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S151ROM */
#define IFX_DMU_HP_PROCON_OTP4_S151ROM_OFF (23u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S152ROM */
#define IFX_DMU_HP_PROCON_OTP4_S152ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S152ROM */
#define IFX_DMU_HP_PROCON_OTP4_S152ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S152ROM */
#define IFX_DMU_HP_PROCON_OTP4_S152ROM_OFF (24u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S153ROM */
#define IFX_DMU_HP_PROCON_OTP4_S153ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S153ROM */
#define IFX_DMU_HP_PROCON_OTP4_S153ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S153ROM */
#define IFX_DMU_HP_PROCON_OTP4_S153ROM_OFF (25u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S154ROM */
#define IFX_DMU_HP_PROCON_OTP4_S154ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S154ROM */
#define IFX_DMU_HP_PROCON_OTP4_S154ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S154ROM */
#define IFX_DMU_HP_PROCON_OTP4_S154ROM_OFF (26u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S155ROM */
#define IFX_DMU_HP_PROCON_OTP4_S155ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S155ROM */
#define IFX_DMU_HP_PROCON_OTP4_S155ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S155ROM */
#define IFX_DMU_HP_PROCON_OTP4_S155ROM_OFF (27u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S156ROM */
#define IFX_DMU_HP_PROCON_OTP4_S156ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S156ROM */
#define IFX_DMU_HP_PROCON_OTP4_S156ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S156ROM */
#define IFX_DMU_HP_PROCON_OTP4_S156ROM_OFF (28u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S157ROM */
#define IFX_DMU_HP_PROCON_OTP4_S157ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S157ROM */
#define IFX_DMU_HP_PROCON_OTP4_S157ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S157ROM */
#define IFX_DMU_HP_PROCON_OTP4_S157ROM_OFF (29u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S158ROM */
#define IFX_DMU_HP_PROCON_OTP4_S158ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S158ROM */
#define IFX_DMU_HP_PROCON_OTP4_S158ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S158ROM */
#define IFX_DMU_HP_PROCON_OTP4_S158ROM_OFF (30u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP4_Bits.S159ROM */
#define IFX_DMU_HP_PROCON_OTP4_S159ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP4_Bits.S159ROM */
#define IFX_DMU_HP_PROCON_OTP4_S159ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP4_Bits.S159ROM */
#define IFX_DMU_HP_PROCON_OTP4_S159ROM_OFF (31u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S160ROM */
#define IFX_DMU_HP_PROCON_OTP5_S160ROM_LEN (1u)

