HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxDmu_bf.h
/** \brief Length for Ifx_DMU_HP_ECPRIO_P0_Bits.S18L */
#define IFX_DMU_HP_ECPRIO_P0_S18L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P0_Bits.S18L */
#define IFX_DMU_HP_ECPRIO_P0_S18L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P0_Bits.S18L */
#define IFX_DMU_HP_ECPRIO_P0_S18L_OFF (18u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P0_Bits.S19L */
#define IFX_DMU_HP_ECPRIO_P0_S19L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P0_Bits.S19L */
#define IFX_DMU_HP_ECPRIO_P0_S19L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P0_Bits.S19L */
#define IFX_DMU_HP_ECPRIO_P0_S19L_OFF (19u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P0_Bits.S20L */
#define IFX_DMU_HP_ECPRIO_P0_S20L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P0_Bits.S20L */
#define IFX_DMU_HP_ECPRIO_P0_S20L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P0_Bits.S20L */
#define IFX_DMU_HP_ECPRIO_P0_S20L_OFF (20u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P0_Bits.S21L */
#define IFX_DMU_HP_ECPRIO_P0_S21L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P0_Bits.S21L */
#define IFX_DMU_HP_ECPRIO_P0_S21L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P0_Bits.S21L */
#define IFX_DMU_HP_ECPRIO_P0_S21L_OFF (21u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P0_Bits.S22L */
#define IFX_DMU_HP_ECPRIO_P0_S22L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P0_Bits.S22L */
#define IFX_DMU_HP_ECPRIO_P0_S22L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P0_Bits.S22L */
#define IFX_DMU_HP_ECPRIO_P0_S22L_OFF (22u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P0_Bits.S23L */
#define IFX_DMU_HP_ECPRIO_P0_S23L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P0_Bits.S23L */
#define IFX_DMU_HP_ECPRIO_P0_S23L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P0_Bits.S23L */
#define IFX_DMU_HP_ECPRIO_P0_S23L_OFF (23u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P0_Bits.S24L */
#define IFX_DMU_HP_ECPRIO_P0_S24L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P0_Bits.S24L */
#define IFX_DMU_HP_ECPRIO_P0_S24L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P0_Bits.S24L */
#define IFX_DMU_HP_ECPRIO_P0_S24L_OFF (24u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P0_Bits.S25L */
#define IFX_DMU_HP_ECPRIO_P0_S25L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P0_Bits.S25L */
#define IFX_DMU_HP_ECPRIO_P0_S25L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P0_Bits.S25L */
#define IFX_DMU_HP_ECPRIO_P0_S25L_OFF (25u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P0_Bits.S26L */
#define IFX_DMU_HP_ECPRIO_P0_S26L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P0_Bits.S26L */
#define IFX_DMU_HP_ECPRIO_P0_S26L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P0_Bits.S26L */
#define IFX_DMU_HP_ECPRIO_P0_S26L_OFF (26u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P0_Bits.S27L */
#define IFX_DMU_HP_ECPRIO_P0_S27L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P0_Bits.S27L */
#define IFX_DMU_HP_ECPRIO_P0_S27L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P0_Bits.S27L */
#define IFX_DMU_HP_ECPRIO_P0_S27L_OFF (27u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P0_Bits.S28L */
#define IFX_DMU_HP_ECPRIO_P0_S28L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P0_Bits.S28L */
#define IFX_DMU_HP_ECPRIO_P0_S28L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P0_Bits.S28L */
#define IFX_DMU_HP_ECPRIO_P0_S28L_OFF (28u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P0_Bits.S29L */
#define IFX_DMU_HP_ECPRIO_P0_S29L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P0_Bits.S29L */
#define IFX_DMU_HP_ECPRIO_P0_S29L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P0_Bits.S29L */
#define IFX_DMU_HP_ECPRIO_P0_S29L_OFF (29u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P0_Bits.S30L */
#define IFX_DMU_HP_ECPRIO_P0_S30L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P0_Bits.S30L */
#define IFX_DMU_HP_ECPRIO_P0_S30L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P0_Bits.S30L */
#define IFX_DMU_HP_ECPRIO_P0_S30L_OFF (30u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P0_Bits.S31L */
#define IFX_DMU_HP_ECPRIO_P0_S31L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P0_Bits.S31L */
#define IFX_DMU_HP_ECPRIO_P0_S31L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P0_Bits.S31L */
#define IFX_DMU_HP_ECPRIO_P0_S31L_OFF (31u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P1_Bits.S32L */
#define IFX_DMU_HP_ECPRIO_P1_S32L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P1_Bits.S32L */
#define IFX_DMU_HP_ECPRIO_P1_S32L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P1_Bits.S32L */
#define IFX_DMU_HP_ECPRIO_P1_S32L_OFF (0u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P1_Bits.S33L */
#define IFX_DMU_HP_ECPRIO_P1_S33L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P1_Bits.S33L */
#define IFX_DMU_HP_ECPRIO_P1_S33L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P1_Bits.S33L */
#define IFX_DMU_HP_ECPRIO_P1_S33L_OFF (1u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P1_Bits.S34L */
#define IFX_DMU_HP_ECPRIO_P1_S34L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P1_Bits.S34L */
#define IFX_DMU_HP_ECPRIO_P1_S34L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P1_Bits.S34L */
#define IFX_DMU_HP_ECPRIO_P1_S34L_OFF (2u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P1_Bits.S35L */
#define IFX_DMU_HP_ECPRIO_P1_S35L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P1_Bits.S35L */
#define IFX_DMU_HP_ECPRIO_P1_S35L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P1_Bits.S35L */
#define IFX_DMU_HP_ECPRIO_P1_S35L_OFF (3u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P1_Bits.S36L */
#define IFX_DMU_HP_ECPRIO_P1_S36L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P1_Bits.S36L */
#define IFX_DMU_HP_ECPRIO_P1_S36L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P1_Bits.S36L */
#define IFX_DMU_HP_ECPRIO_P1_S36L_OFF (4u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P1_Bits.S37L */
#define IFX_DMU_HP_ECPRIO_P1_S37L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P1_Bits.S37L */
#define IFX_DMU_HP_ECPRIO_P1_S37L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P1_Bits.S37L */
#define IFX_DMU_HP_ECPRIO_P1_S37L_OFF (5u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P1_Bits.S38L */
#define IFX_DMU_HP_ECPRIO_P1_S38L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P1_Bits.S38L */
#define IFX_DMU_HP_ECPRIO_P1_S38L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P1_Bits.S38L */
#define IFX_DMU_HP_ECPRIO_P1_S38L_OFF (6u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P1_Bits.S39L */
#define IFX_DMU_HP_ECPRIO_P1_S39L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P1_Bits.S39L */
#define IFX_DMU_HP_ECPRIO_P1_S39L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P1_Bits.S39L */
#define IFX_DMU_HP_ECPRIO_P1_S39L_OFF (7u)

