HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxDmu_bf.h
/** \brief Length for Ifx_DMU_HP_ECPRIO_P4_Bits.S128L */
#define IFX_DMU_HP_ECPRIO_P4_S128L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P4_Bits.S128L */
#define IFX_DMU_HP_ECPRIO_P4_S128L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P4_Bits.S128L */
#define IFX_DMU_HP_ECPRIO_P4_S128L_OFF (0u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P4_Bits.S129L */
#define IFX_DMU_HP_ECPRIO_P4_S129L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P4_Bits.S129L */
#define IFX_DMU_HP_ECPRIO_P4_S129L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P4_Bits.S129L */
#define IFX_DMU_HP_ECPRIO_P4_S129L_OFF (1u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P4_Bits.S130L */
#define IFX_DMU_HP_ECPRIO_P4_S130L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P4_Bits.S130L */
#define IFX_DMU_HP_ECPRIO_P4_S130L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P4_Bits.S130L */
#define IFX_DMU_HP_ECPRIO_P4_S130L_OFF (2u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P4_Bits.S131L */
#define IFX_DMU_HP_ECPRIO_P4_S131L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P4_Bits.S131L */
#define IFX_DMU_HP_ECPRIO_P4_S131L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P4_Bits.S131L */
#define IFX_DMU_HP_ECPRIO_P4_S131L_OFF (3u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P4_Bits.S132L */
#define IFX_DMU_HP_ECPRIO_P4_S132L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P4_Bits.S132L */
#define IFX_DMU_HP_ECPRIO_P4_S132L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P4_Bits.S132L */
#define IFX_DMU_HP_ECPRIO_P4_S132L_OFF (4u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P4_Bits.S133L */
#define IFX_DMU_HP_ECPRIO_P4_S133L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P4_Bits.S133L */
#define IFX_DMU_HP_ECPRIO_P4_S133L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P4_Bits.S133L */
#define IFX_DMU_HP_ECPRIO_P4_S133L_OFF (5u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P4_Bits.S134L */
#define IFX_DMU_HP_ECPRIO_P4_S134L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P4_Bits.S134L */
#define IFX_DMU_HP_ECPRIO_P4_S134L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P4_Bits.S134L */
#define IFX_DMU_HP_ECPRIO_P4_S134L_OFF (6u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P4_Bits.S135L */
#define IFX_DMU_HP_ECPRIO_P4_S135L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P4_Bits.S135L */
#define IFX_DMU_HP_ECPRIO_P4_S135L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P4_Bits.S135L */
#define IFX_DMU_HP_ECPRIO_P4_S135L_OFF (7u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P4_Bits.S136L */
#define IFX_DMU_HP_ECPRIO_P4_S136L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P4_Bits.S136L */
#define IFX_DMU_HP_ECPRIO_P4_S136L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P4_Bits.S136L */
#define IFX_DMU_HP_ECPRIO_P4_S136L_OFF (8u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P4_Bits.S137L */
#define IFX_DMU_HP_ECPRIO_P4_S137L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P4_Bits.S137L */
#define IFX_DMU_HP_ECPRIO_P4_S137L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P4_Bits.S137L */
#define IFX_DMU_HP_ECPRIO_P4_S137L_OFF (9u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P4_Bits.S138L */
#define IFX_DMU_HP_ECPRIO_P4_S138L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P4_Bits.S138L */
#define IFX_DMU_HP_ECPRIO_P4_S138L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P4_Bits.S138L */
#define IFX_DMU_HP_ECPRIO_P4_S138L_OFF (10u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P4_Bits.S139L */
#define IFX_DMU_HP_ECPRIO_P4_S139L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P4_Bits.S139L */
#define IFX_DMU_HP_ECPRIO_P4_S139L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P4_Bits.S139L */
#define IFX_DMU_HP_ECPRIO_P4_S139L_OFF (11u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P4_Bits.S140L */
#define IFX_DMU_HP_ECPRIO_P4_S140L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P4_Bits.S140L */
#define IFX_DMU_HP_ECPRIO_P4_S140L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P4_Bits.S140L */
#define IFX_DMU_HP_ECPRIO_P4_S140L_OFF (12u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P4_Bits.S141L */
#define IFX_DMU_HP_ECPRIO_P4_S141L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P4_Bits.S141L */
#define IFX_DMU_HP_ECPRIO_P4_S141L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P4_Bits.S141L */
#define IFX_DMU_HP_ECPRIO_P4_S141L_OFF (13u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P4_Bits.S142L */
#define IFX_DMU_HP_ECPRIO_P4_S142L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P4_Bits.S142L */
#define IFX_DMU_HP_ECPRIO_P4_S142L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P4_Bits.S142L */
#define IFX_DMU_HP_ECPRIO_P4_S142L_OFF (14u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P4_Bits.S143L */
#define IFX_DMU_HP_ECPRIO_P4_S143L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P4_Bits.S143L */
#define IFX_DMU_HP_ECPRIO_P4_S143L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P4_Bits.S143L */
#define IFX_DMU_HP_ECPRIO_P4_S143L_OFF (15u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P4_Bits.S144L */
#define IFX_DMU_HP_ECPRIO_P4_S144L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P4_Bits.S144L */
#define IFX_DMU_HP_ECPRIO_P4_S144L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P4_Bits.S144L */
#define IFX_DMU_HP_ECPRIO_P4_S144L_OFF (16u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P4_Bits.S145L */
#define IFX_DMU_HP_ECPRIO_P4_S145L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P4_Bits.S145L */
#define IFX_DMU_HP_ECPRIO_P4_S145L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P4_Bits.S145L */
#define IFX_DMU_HP_ECPRIO_P4_S145L_OFF (17u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P4_Bits.S146L */
#define IFX_DMU_HP_ECPRIO_P4_S146L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P4_Bits.S146L */
#define IFX_DMU_HP_ECPRIO_P4_S146L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P4_Bits.S146L */
#define IFX_DMU_HP_ECPRIO_P4_S146L_OFF (18u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P4_Bits.S147L */
#define IFX_DMU_HP_ECPRIO_P4_S147L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P4_Bits.S147L */
#define IFX_DMU_HP_ECPRIO_P4_S147L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P4_Bits.S147L */
#define IFX_DMU_HP_ECPRIO_P4_S147L_OFF (19u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P4_Bits.S148L */
#define IFX_DMU_HP_ECPRIO_P4_S148L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P4_Bits.S148L */
#define IFX_DMU_HP_ECPRIO_P4_S148L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P4_Bits.S148L */
#define IFX_DMU_HP_ECPRIO_P4_S148L_OFF (20u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P4_Bits.S149L */
#define IFX_DMU_HP_ECPRIO_P4_S149L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P4_Bits.S149L */
#define IFX_DMU_HP_ECPRIO_P4_S149L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P4_Bits.S149L */
#define IFX_DMU_HP_ECPRIO_P4_S149L_OFF (21u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P4_Bits.S150L */
#define IFX_DMU_HP_ECPRIO_P4_S150L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P4_Bits.S150L */
#define IFX_DMU_HP_ECPRIO_P4_S150L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P4_Bits.S150L */
#define IFX_DMU_HP_ECPRIO_P4_S150L_OFF (22u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P4_Bits.S151L */
#define IFX_DMU_HP_ECPRIO_P4_S151L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P4_Bits.S151L */
#define IFX_DMU_HP_ECPRIO_P4_S151L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P4_Bits.S151L */
#define IFX_DMU_HP_ECPRIO_P4_S151L_OFF (23u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P4_Bits.S152L */
#define IFX_DMU_HP_ECPRIO_P4_S152L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P4_Bits.S152L */
#define IFX_DMU_HP_ECPRIO_P4_S152L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P4_Bits.S152L */
#define IFX_DMU_HP_ECPRIO_P4_S152L_OFF (24u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P4_Bits.S153L */
#define IFX_DMU_HP_ECPRIO_P4_S153L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P4_Bits.S153L */
#define IFX_DMU_HP_ECPRIO_P4_S153L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P4_Bits.S153L */
#define IFX_DMU_HP_ECPRIO_P4_S153L_OFF (25u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P4_Bits.S154L */
#define IFX_DMU_HP_ECPRIO_P4_S154L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P4_Bits.S154L */
#define IFX_DMU_HP_ECPRIO_P4_S154L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P4_Bits.S154L */
#define IFX_DMU_HP_ECPRIO_P4_S154L_OFF (26u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P4_Bits.S155L */
#define IFX_DMU_HP_ECPRIO_P4_S155L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P4_Bits.S155L */
#define IFX_DMU_HP_ECPRIO_P4_S155L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P4_Bits.S155L */
#define IFX_DMU_HP_ECPRIO_P4_S155L_OFF (27u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P4_Bits.S156L */
#define IFX_DMU_HP_ECPRIO_P4_S156L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P4_Bits.S156L */
#define IFX_DMU_HP_ECPRIO_P4_S156L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P4_Bits.S156L */
#define IFX_DMU_HP_ECPRIO_P4_S156L_OFF (28u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P4_Bits.S157L */
#define IFX_DMU_HP_ECPRIO_P4_S157L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P4_Bits.S157L */
#define IFX_DMU_HP_ECPRIO_P4_S157L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P4_Bits.S157L */
#define IFX_DMU_HP_ECPRIO_P4_S157L_OFF (29u)

