HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxDmu_bf.h
/** \brief Length for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM32ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM32ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM32ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM32ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM32ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM32ROM_OFF (0u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM33ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM33ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM33ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM33ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM33ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM33ROM_OFF (1u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM34ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM34ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM34ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM34ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM34ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM34ROM_OFF (2u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM35ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM35ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM35ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM35ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM35ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM35ROM_OFF (3u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM36ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM36ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM36ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM36ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM36ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM36ROM_OFF (4u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM37ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM37ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM37ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM37ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM37ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM37ROM_OFF (5u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM38ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM38ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM38ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM38ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM38ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM38ROM_OFF (6u)

/** \brief Length for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM39ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM39ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM39ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM39ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSMCOTP1_Bits.HSM39ROM */
#define IFX_DMU_SP_PROCONHSMCOTP1_HSM39ROM_OFF (7u)

/** \brief Length for Ifx_DMU_SP_PROCONHSM_Bits.HSMDBGDIS */
#define IFX_DMU_SP_PROCONHSM_HSMDBGDIS_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSM_Bits.HSMDBGDIS */
#define IFX_DMU_SP_PROCONHSM_HSMDBGDIS_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSM_Bits.HSMDBGDIS */
#define IFX_DMU_SP_PROCONHSM_HSMDBGDIS_OFF (0u)

/** \brief Length for Ifx_DMU_SP_PROCONHSM_Bits.DBGIFLCK */
#define IFX_DMU_SP_PROCONHSM_DBGIFLCK_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSM_Bits.DBGIFLCK */
#define IFX_DMU_SP_PROCONHSM_DBGIFLCK_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSM_Bits.DBGIFLCK */
#define IFX_DMU_SP_PROCONHSM_DBGIFLCK_OFF (1u)

/** \brief Length for Ifx_DMU_SP_PROCONHSM_Bits.TSTIFLCK */
#define IFX_DMU_SP_PROCONHSM_TSTIFLCK_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSM_Bits.TSTIFLCK */
#define IFX_DMU_SP_PROCONHSM_TSTIFLCK_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSM_Bits.TSTIFLCK */
#define IFX_DMU_SP_PROCONHSM_TSTIFLCK_OFF (2u)

/** \brief Length for Ifx_DMU_SP_PROCONHSM_Bits.HSMTSTDIS */
#define IFX_DMU_SP_PROCONHSM_HSMTSTDIS_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSM_Bits.HSMTSTDIS */
#define IFX_DMU_SP_PROCONHSM_HSMTSTDIS_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSM_Bits.HSMTSTDIS */
#define IFX_DMU_SP_PROCONHSM_HSMTSTDIS_OFF (3u)

/** \brief Length for Ifx_DMU_SP_PROCONHSM_Bits.HSMTRDIS */
#define IFX_DMU_SP_PROCONHSM_HSMTRDIS_LEN (2u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSM_Bits.HSMTRDIS */
#define IFX_DMU_SP_PROCONHSM_HSMTRDIS_MSK (0x3u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSM_Bits.HSMTRDIS */
#define IFX_DMU_SP_PROCONHSM_HSMTRDIS_OFF (4u)

/** \brief Length for Ifx_DMU_SP_PROCONHSM_Bits.HSMTRTYPE */
#define IFX_DMU_SP_PROCONHSM_HSMTRTYPE_LEN (1u)

/** \brief Mask for Ifx_DMU_SP_PROCONHSM_Bits.HSMTRTYPE */
#define IFX_DMU_SP_PROCONHSM_HSMTRTYPE_MSK (0x1u)

/** \brief Offset for Ifx_DMU_SP_PROCONHSM_Bits.HSMTRTYPE */
#define IFX_DMU_SP_PROCONHSM_HSMTRTYPE_OFF (6u)

/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXDMU_BF_H */
